#include <stdio.h>

/*
编写一个程序，读入一个正整数，把所有那些连续的和为给定正整数的正整数找出来。
例如，如果输入27,发现2~7,8~10,13与14的和是27，这就是解答；如果输入的是10000，应该有18~142,297~412, 388~412,1998~2002这4组。
注意，不一定会有答案，如4,16就无解。

输入
输入一个正整数。

输出
输出所有连续正整数组，满足其和为给定的正整数。若没有答案，则输出”No answer!”.

输入样例 1 
500
输出样例 1
8~32
59~66
98~102
*/

int main() {
	int num;
	int flag = 1;
	scanf("%d", &num);
	for (int i = 1; i < num; i++) {
		for (int j = i + 1; j <= num - i; j++) {
			if (num * 2 == (i + j) * (j - i + 1)) {
				flag = 0;
				printf("%d~%d\n", i, j);
			}
		}
	}
	if (flag) {
		printf("No answer!\n");
	}
}